mixaillanatolich/Mesh-Light/nrf5_SDK_for_Mesh_v4.1.0_src/examples/light/src/main.c
/* Copyright (c) 2010 - 2020, Nordic Semiconductor ASA
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 * list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include <stdint.h>
#include <string.h>

/* HAL */
#include "boards.h"
#include "app_timer.h"

#include "simple_hal.h"

/* Core */
#include "nrf_mesh_config_core.h"
#include "nrf_mesh_gatt.h"
#include "nrf_mesh_configure.h"
#include "nrf_mesh_events.h"
#include "nrf_mesh.h"
#include "mesh_stack.h"
#include "device_state_manager.h"
#include "access_config.h"
#include "proxy.h"
#include "flash_manager.h"
#include "mesh_config.h"

/* Provisioning and configuration */
#include "mesh_provisionee.h"
#include "mesh_app_utils.h"

/* Models */
#include "generic_onoff_server.h"
#include "generic_level_server.h"
#include "access.h"
/* Logging and RTT */
#include "log.h"
#include "rtt_input.h"

/* Example specific includes */
#include "app_config.h"
#include "nrf_mesh_config_app.h"
#include "nrf.h"
#include "example_common.h"
#include "pwm_utils.h"
#include "nrf_mesh_config_examples.h"
#include "app_onoff.h"
#include "app_level.h"
#include "ble_softdevice_support.h"
#include "config_server.h"
#include "app_config_models.h"
#include "app_main_config.h"
#include "flash_helper.h"
#include "app_scheduler.h"

#include "nrf_mesh_dfu.h"

#include "base_communication_common.h"
#include "base_communication_client.h"
#include "base_communication_server.h"

#include "serial_commands.h"
/*****************************************************************************
 * Definitions
 *****************************************************************************/


/*****************************************************************************
 * Variables
 *****************************************************************************/

static const uint8_t    app_version = 1;
static const uint16_t   app_build   = 5;

static bool m_device_provisioned;
static dsm_local_unicast_address_t node_address;

char *device_name_with_addr;

static led_config_t led1_config;

static timestamp_t commissioning_start_time = 0;

static uint8_t configure_finished_successfull;

static base_communication_server_t m_base_communication_command_server;
static base_communication_client_t m_base_communication_command_client;
 /*****************************************************************************
 * END variables
 *****************************************************************************/

/*****************************************************************************
 * DFU Support
 *****************************************************************************/

static bool fw_updated_event_is_for_me(const nrf_mesh_evt_dfu_t * p_evt)
{
    switch (p_evt->fw_outdated.transfer.dfu_type)
    {
        case NRF_MESH_DFU_TYPE_APPLICATION:
            return (p_evt->fw_outdated.current.application.app_id == p_evt->fw_outdated.transfer.id.application.app_id &&
                    p_evt->fw_outdated.current.application.company_id == p_evt->fw_outdated.transfer.id.application.company_id &&
                    p_evt->fw_outdated.current.application.app_version < p_evt->fw_outdated.transfer.id.application.app_version);

        case NRF_MESH_DFU_TYPE_BOOTLOADER:
            return (p_evt->fw_outdated.current.bootloader.bl_id == p_evt->fw_outdated.transfer.id.bootloader.bl_id &&
                    p_evt->fw_outdated.current.bootloader.bl_version < p_evt->fw_outdated.transfer.id.bootloader.bl_version);

        case NRF_MESH_DFU_TYPE_SOFTDEVICE:
            return false;

        default:
            return false;
    }
}

static const uint32_t * optimal_bank_address(void)
{
    /* The incoming transfer has to fit on both sides of the bank address: First it needs to fit
     * above the bank address when we receive it, then it needs to fit below the bank address when
     * we install it. We want to put the bank address in the middle of the available application
     * code area, to maximize the potential transfer size we can accept. */
    const uint32_t * p_start;
    uint32_t dummy;
    ERROR_CHECK(mesh_stack_persistence_flash_usage(&p_start, &dummy));

    __LOG_RELEASE(LOG_SRC_APP, LOG_LEVEL_INFO, "p_start %X\n", (intptr_t)p_start);
    __LOG_RELEASE(LOG_SRC_APP, LOG_LEVEL_INFO, "dummy %X\n", dummy);
    __LOG_RELEASE(LOG_SRC_APP, LOG_LEVEL_INFO, "CODE_START %X\n", CODE_START);
    __LOG_RELEASE(LOG_SRC_APP, LOG_LEVEL_INFO, "CODE_END %X\n", CODE_END);
    __LOG_RELEASE(LOG_SRC_APP, LOG_LEVEL_INFO, "CODE_SIZE %X\n", CODE_SIZE);

    uint32_t middle_of_app_area = (CODE_START + (intptr_t) p_start) / 2;
    __LOG_RELEASE(LOG_SRC_APP, LOG_LEVEL_INFO, "middle_of_app_area %X\n", middle_of_app_area);

    /* The bank can't start in the middle of the application code, and should be page aligned: */
    const uint32_t *bank_address = (const uint32_t *) ALIGN_VAL(MAX(middle_of_app_area, CODE_END), PAGE_SIZE);
    __LOG_RELEASE(LOG_SRC_APP, LOG_LEVEL_INFO, "bank_address %X\n", bank_address);
    
    return bank_address;
}
/*
         15747>, main.c,  180, p_start 71000
<t:      15749>, main.c,  181, dummy 6000
<t:      15751>, main.c,  182, CODE_START 26000
<t:      15753>, main.c,  183, CODE_END 4ECAC
<t:      15755>, main.c,  184, CODE_SIZE 28CAC
<t:      15757>, main.c,  187, middle_of_app_area 4B800
<t:      15760>, main.c,  191, bank_address 4F000

*/



static void factory_reset(void);

/*****************************************************************************
 * Forward declaration of static functions
 *****************************************************************************/
static void app_onoff_server_set_cb(const app_onoff_server_t * p_server, bool onoff);
static void app_onoff_server_get_cb(const app_onoff_server_t * p_server, bool * p_present_onoff);
static void app_onoff_server_transition_cb(const app_onoff_server_t * p_server,
                                                uint32_t transition_time_ms, bool target_onoff);


