mixaillanatolich/Mesh-Light/nrf5_SDK_for_Mesh_v4.1.0_src/examples/light/src/main.c
static void app_level_server_set_cb(const app_level_server_t * p_server, uint16_t present_level);
static void app_level_server_get_cb(const app_level_server_t * p_server, uint16_t * p_present_level);
static void app_level_server_transition_cb(const app_level_server_t * p_server,
                                                uint32_t transition_time_ms, uint16_t target_level,
                                                app_transition_type_t transition_type);


/*****************************************************************************
 * Static variables
 *****************************************************************************/


/* PWM hardware instance and associated variables */
/* Note: PWM cycle period determines the the max value that can be used to represent 100%
 * duty cycles, therefore present_level value scaling is required to get pwm tick value
 * between 0 and pwm_utils_contex_t:pwm_ticks_max.
 */
static APP_PWM_INSTANCE(PWM0, 1);
static app_pwm_config_t m_pwm0_config = APP_PWM_DEFAULT_CONFIG_1CH(200, BSP_LED_0);
static pwm_utils_contex_t m_pwm = {
                                    .p_pwm = &PWM0,
                                    .p_pwm_config = &m_pwm0_config,
                                    .channel = 0
                                  };


/****************************** Storage *************************************/

/* Try to store app data. If busy, ask user to manually initiate operation. */
static void save_led_config() {

    if (!m_device_provisioned) { return; }

    uint32_t status = app_flash_data_store(LED1_CONFIG_ENTRY_HANDLE, &led1_config, sizeof(led1_config));
    if (status == NRF_SUCCESS) {
        __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Storing: Led config\n");
    } else if (status == NRF_ERROR_NOT_SUPPORTED) {
       __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Cannot store Led config: Persistent storage not enabled\n");
    } else {
        __LOG(LOG_SRC_APP, LOG_LEVEL_ERROR, "Flash busy. Cannot store Led config. To try again. \n");
    }

}

static void load_led_config() {

    if (app_flash_data_load(LED1_CONFIG_ENTRY_HANDLE, &led1_config, sizeof(led1_config)) == NRF_SUCCESS) {
        __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Led config loaded. level: %x - %d\n", led1_config.level, led1_config.level);
        
    } else {
        __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Failed to load led config\n");

        if (m_device_provisioned) {
            __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Provisioning not finished successfully! hard reset!\n");
            factory_reset();
            return;
        }

        led1_config.on = true;
        led1_config.level = LED_LEVEL_DEFAULT;
        led1_config.min_level = 0;
        led1_config.max_level = UINT16_MAX;

        save_led_config();
    }
}

/****************************************************************************/

/************************** LED Control *************************************/

static void apply_led_config() {
    if (led1_config.on) {
        pwm_utils_enable(&m_pwm);
        pwm_utils_level_set(&m_pwm, led1_config.level);
        __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Get: Level: %d\n", pwm_utils_level_get(&m_pwm));
    } else {
        pwm_utils_disable(&m_pwm);
    }

    serial_send_on_off_command(led1_config.on);
}

void led1_level_set(uint16_t level) {
    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "SET: Level: %d\n", level);
    led1_config.level = level;
    apply_led_config();
    save_led_config();
}

void led1_state_on_set(bool is_on) {
    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "SET: State: %d\n", is_on);
    led1_config.on = is_on;
    apply_led_config();
    save_led_config();
}


/****************************************************************************/


/* Generic OnOff server structure definition and initialization */
APP_ONOFF_SERVER_DEF(m_onoff_server_0,
                     APP_FORCE_SEGMENTATION,
                     APP_MIC_SIZE,
                     app_onoff_server_set_cb,
                     app_onoff_server_get_cb,
                     app_onoff_server_transition_cb)

/* Callback for updating the hardware state */
static void app_onoff_server_set_cb(const app_onoff_server_t * p_server, bool onoff)
{
    /* Resolve the server instance here if required, this example uses only 1 instance. */

    led1_state_on_set(onoff);
}

/* Callback for reading the hardware state */
static void app_onoff_server_get_cb(const app_onoff_server_t * p_server, bool * p_present_onoff)
{
    /* Resolve the server instance here if required, this example uses only 1 instance. */


    *p_present_onoff = led1_config.on;
}

/* Callback for updating the hardware state */
static void app_onoff_server_transition_cb(const app_onoff_server_t * p_server,
                                                uint32_t transition_time_ms, bool target_onoff)
{
    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Transition time: %d, Target OnOff: %d\n",
                                       transition_time_ms, target_onoff);
}

/* Application level generic level server structure definition and initialization */
APP_LEVEL_SERVER_DEF(m_level_server_0,
                     APP_FORCE_SEGMENTATION,
                     APP_MIC_SIZE,
                     NULL,
                     app_level_server_set_cb,
                     app_level_server_get_cb,
                     app_level_server_transition_cb);


/* Callback for updating the hardware state */
static void app_level_server_set_cb(const app_level_server_t * p_server, uint16_t present_level)
{
    led1_level_set(present_level);
}

/* Callback for reading the hardware state */
static void app_level_server_get_cb(const app_level_server_t * p_server, uint16_t * p_present_level)
{
    *p_present_level = led1_config.level;
}

/* Callback for updateing according to transition time. */
static void app_level_server_transition_cb(const app_level_server_t * p_server,
                                                uint32_t transition_time_ms, uint16_t target_level,
                                                app_transition_type_t transition_type)
{
    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Transition time: %d, Target level: %d, Transition type: %d\n",
                                       transition_time_ms, target_level, transition_type);
}

/*************************************************************************************************/
void serial_command_received(serial_command_t command){
    uint8_t command_code = command.command_id;

    switch (command_code) {
        case SERIAL_COMMAND_ACK:
            __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "SERIAL: ACK command received\n");
            break;
        case SERIAL_COMMAND_FACTORY_RESET:
            __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "SERIAL: Factory Reset command received\n");
            // Send ACK
            serial_send_ack_command(0);

            factory_reset();
            break;
        default:
            // UNKNOWN COMMAND
            __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "SERIAL: Unknown command received\n");
    }
}

void serial_status_received(bool connected) {
    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "serial_status_received %d \n", connected);

