mixaillanatolich/Mesh-Light/nrf5_SDK_for_Mesh_v4.1.0_src/examples/light/src/main.c
}


/************************** base communication command handle *************************************/

uint16_t convertFrom8To16(uint8_t dataFirst, uint8_t dataSecond) {
    uint16_t dataBoth = 0x0000;

    dataBoth = dataFirst;
    dataBoth = dataBoth << 8;
    dataBoth |= dataSecond;
    return dataBoth;
}



static uint8_t base_communication_command_cb(const base_communication_server_t * p_server, 
                                              const base_communication_msg_t *command, 
                                              base_communication_msg_response_t * p_response) {

    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "base_ommunication_command_id %02x\n",command->opcode);
    //__LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "tid %d \n",command->tid);
   // __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "length %d \n",command->length);
 //   __LOG_XB(LOG_SRC_APP, LOG_LEVEL_INFO, "Unencrypted data", command->command_buffer, command->length);

    if (command->opcode == BASE_COMMUNICATION_SUB_COMMAND_COMMISSIONING_FINISHED) {

        fwid_t* p_fwid = nrf_mesh_dfu_current_fwid_get();

        static uint8_t msg[18];
        msg[0] = configure_finished_successfull;
        msg[1] = app_version;
        msg[2] = (app_build & 0xff);
        msg[3] = (app_build >> 8);

        msg[4] = (p_fwid->sd & 0xff);
        msg[5] = (p_fwid->sd >> 8);
        msg[6] = p_fwid->bootloader.bl_id;
        msg[7] = p_fwid->bootloader.bl_version;
        
        msg[8] = (uint8_t)p_fwid->app.company_id;
        msg[9] = (uint8_t)(p_fwid->app.company_id>>8);
        msg[10] = (uint8_t)(p_fwid->app.company_id>>16);
        msg[11] = (uint8_t)(p_fwid->app.company_id>>24);

        msg[12] = (p_fwid->app.app_id & 0xff);
        msg[13] = (p_fwid->app.app_id >> 8);

        msg[14] = (uint8_t)p_fwid->app.app_version;
        msg[15] = (uint8_t)(p_fwid->app.app_version>>8);
        msg[16] = (uint8_t)(p_fwid->app.app_version>>16);
        msg[17] = (uint8_t)(p_fwid->app.app_version>>24);
        
        p_response->response = &msg[0];
        p_response->length = 18;
        
        if (!configure_finished_successfull) {
            m_device_provisioned = true;
            commissioning_start_time = 0;
            led1_config.on = true;
            led1_config.level = LED_LEVEL_DEFAULT;
            led1_config.min_level = 0;
            led1_config.max_level = UINT16_MAX;

            save_led_config();
        }

        return BASE_COMMUNICATION_STATUS_MESSAGE;
    } else if (command->opcode == BASE_COMMUNICATION_SUB_COMMAND_IP_ADDR_GET) {

        ble_gap_addr_t ble_addr;
        sd_ble_gap_addr_get(&ble_addr);

        static uint8_t msg[6];
        msg[0] = ble_addr.addr[0];
        msg[1] = ble_addr.addr[1];
        msg[2] = ble_addr.addr[2];
        msg[3] = ble_addr.addr[3];
        msg[4] = ble_addr.addr[4];
        msg[5] = ble_addr.addr[5];

        p_response->response = &msg[0];
        p_response->length = 6;

        return BASE_COMMUNICATION_STATUS_MESSAGE;

    } else if (command->opcode == BASE_COMMUNICATION_SUB_COMMAND_FW_VERSION_GET) {

        static uint8_t msg[3];
        msg[0] = app_version;
        msg[1] = (app_build & 0xff);
        msg[2] = (app_build >> 8);

        p_response->response = &msg[0];
        p_response->length = 3;

        return BASE_COMMUNICATION_STATUS_MESSAGE;

    } else if (command->opcode == BASE_COMMUNICATION_SUB_COMMAND_FW_DFU) {
        uint32_t res = nrf_mesh_dfu_rx(command->command, command->length, NULL);
        uint8_t *res_p = (uint8_t *)&res;
        static uint8_t msg[4];
        msg[0] = res_p[0];
        msg[1] = res_p[1];
        msg[2] = res_p[2];
        msg[3] = res_p[3];

        p_response->response = &msg[0];
        p_response->length = 4;
        if (res != 0) {
            __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Msg resp %d - %x\n",res, res);
        }
        return BASE_COMMUNICATION_STATUS_MESSAGE;

    } 

    return BASE_COMMUNICATION_STATUS_ERROR_NO_HANDLER;
}

static void base_communication_command_timeout_cb(access_model_handle_t handle, void * p_client)
{
     __LOG(LOG_SRC_APP, LOG_LEVEL_ERROR, "Acknowledged send timedout\n");
}

static void base_communication_command_status_cb(const base_communication_client_t * p_client, base_communication_status_t status, uint16_t src)
{
    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "src %02x \n", src);
    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "status %02x \n", status);
}

/****************************************************************************/

static void app_model_init(void)
{
    /* Instantiate onoff server on element index APP_ONOFF_ELEMENT_INDEX */
    ERROR_CHECK(app_onoff_init(&m_onoff_server_0, APP_ONOFF_ELEMENT_INDEX));
    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "App OnOff Model Handle: %d\n", m_onoff_server_0.server.model_handle);

    /* Instantiate level server on element index 0 */
    ERROR_CHECK(app_level_init(&m_level_server_0, APP_LEVEL_ELEMENT_INDEX));
    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "App Level Model Handle: %d\n", m_level_server_0.server.model_handle);

    m_base_communication_command_server.command_cb = base_communication_command_cb;
    ERROR_CHECK(base_communication_server_init(&m_base_communication_command_server, 0));
    ERROR_CHECK(access_model_subscription_list_alloc(m_base_communication_command_server.model_handle));

    m_base_communication_command_client.status_cb = base_communication_command_status_cb;
    m_base_communication_command_client.timeout_cb = base_communication_command_timeout_cb;
    //__LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Initializing client %d\n", base_generic_client_init(&m_base_generic_command_client, 0));
    ERROR_CHECK(base_communication_client_init(&m_base_communication_command_client, 0));
    ERROR_CHECK(access_model_subscription_list_alloc(m_base_communication_command_client.model_handle));
}

/*************************************************************************************************/

static void node_reset(void) {
    __LOG_RELEASE(LOG_SRC_APP, LOG_LEVEL_INFO, "----- Node reset  -----\n");
    /* This function may return if there are ongoing flash operations. */
    hal_led_blink_ms(LEDS_MASK, LED_BLINK_INTERVAL_MS, LED_BLINK_CNT_RESET);
    mesh_stack_device_reset();
}

static void factory_reset(void) {

//    if (mesh_stack_is_device_provisioned()) {
#if MESH_FEATURE_GATT_PROXY_ENABLED
        (void) proxy_stop();
#endif
        app_flash_clear(&led1_config, sizeof(led1_config));
        mesh_stack_config_clear();
        node_reset();
//    } else {
//        __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "The device is unprovisioned. Resetting has no effect.\n");
//    }

