mixaillanatolich/Mesh-Light/nrf5_SDK_for_Mesh_v4.1.0_src/examples/light/src/main.c
}

static void config_server_evt_cb(const config_server_evt_t * p_evt) {
    if (p_evt->type == CONFIG_SERVER_EVT_NODE_RESET) {
        /* Trigger clearing of application data and schedule node reset. */
        factory_reset();
    } else if (p_evt->type == CONFIG_SERVER_EVT_APPKEY_ADD) {
        uint32_t status = app_config_bind_app_keys(node_address);
        __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "app_config_bind_app_keys: %x\n",status);
        if (status != NRF_SUCCESS) {
            configure_finished_successfull = 0x01;
            return;
        }
         status = app_config_health_model_publication(node_address);
        __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "app_config_health_model_publication: %x\n",status);
        if (status != NRF_SUCCESS) {
            configure_finished_successfull = 0x02;
            return;
        }
        status = app_config_led_status_model_publication(node_address);
        __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "app_config_led_status_model_publication: %x\n",status);
        if (status != NRF_SUCCESS) {
            configure_finished_successfull = 0x03;
            return;
        }
        status = app_config_led_level_model_publication(node_address);
        __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "app_config_led_level_model_publication: %x\n",status);
        if (status != NRF_SUCCESS) {
            configure_finished_successfull = 0x04;
            return;
        }
        status = app_config_subscription_to_communication_group(node_address);
        __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "app_config_subscription_to_communication_group: %x\n",status);
        if (status != NRF_SUCCESS) {
            configure_finished_successfull = 0x05;
            return;
        }        
        status = app_config_communication_client_model_publication(node_address);
        __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "app_config_communication_client_model_publication: %x\n",status);
        if (status != NRF_SUCCESS) {
            configure_finished_successfull = 0x06;
            return;
        }

    }
}

#if NRF_MESH_LOG_ENABLE
static const char m_usage_string[] = "run!\n";
#endif

static void button_event_handler(uint32_t button_number)
{
    /* Increase button number because the buttons on the board is marked with 1 to 4 */
    button_number++;
    uint16_t new_level = 0;
    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Button %u pressed\n", button_number);
    switch (button_number) {
        case 1:{
            new_level = (led1_config.level < APP_LEVEL_STEP_SIZE) ? 0 : led1_config.level - APP_LEVEL_STEP_SIZE;
            break;
        }

        case 2: {
            new_level = ((UINT16_MAX - led1_config.level) < APP_LEVEL_STEP_SIZE) ? UINT16_MAX : led1_config.level + APP_LEVEL_STEP_SIZE;
            break;
        }

        case 3: {
            led1_state_on_set(!led1_config.on);
            app_onoff_status_publish(&m_onoff_server_0);
            break;
        }

        /* Initiate node reset */
        case 4: {
            /* Clear all the states to reset the node. */
            factory_reset();
            break;
        }

        default:
            __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, m_usage_string);
            break;
    }

    if (button_number == 1 || button_number == 2) {
        led1_level_set(new_level);
        app_level_current_value_publish(&m_level_server_0);
    }
}

static void app_rtt_input_handler(int key)
{
    if (key >= '1' && key <= '4')
    {
        uint32_t button_number = key - '1';
        button_event_handler(button_number);
    }
    else
    {
        __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, m_usage_string);
    }
}

static void device_identification_start_cb(uint8_t attention_duration_s)
{

    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "device_identification_start_cb\n");

    hal_led_mask_set(LEDS_MASK, false);
    hal_led_blink_ms(BSP_LED_2_MASK  | BSP_LED_3_MASK,
                     LED_BLINK_ATTENTION_INTERVAL_MS,
                     LED_BLINK_ATTENTION_COUNT(attention_duration_s));
}

static void device_identification_stop_cb()
{
    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "device_identification_stop_cb\n");
}

static void provisioning_aborted_cb(void)
{

    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "provisioning_aborted_cb\n");

    hal_led_blink_stop();
}

static void unicast_address_print(void)
{
    __LOG_RELEASE(LOG_SRC_APP, LOG_LEVEL_INFO, "Node Address: 0x%04x \n", node_address.address_start);
}

static void provisioning_complete_cb(void)
{
    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Successfully provisioned\n");

#if MESH_FEATURE_GATT_ENABLED
    /* Restores the application parameters after switching from the Provisioning
     * service to the Proxy  */
    gap_params_init();
    conn_params_init();
#endif

    commissioning_start_time = timer_now();

    dsm_local_unicast_addresses_get(&node_address);

    unicast_address_print();

    hal_led_blink_stop();
    hal_led_mask_set(LEDS_MASK, LED_MASK_STATE_OFF);
    hal_led_blink_ms(LEDS_MASK, LED_BLINK_INTERVAL_MS, LED_BLINK_CNT_PROV);
}

static void models_init_cb(void)
{
    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Initializing and adding models\n");
    app_model_init();
}

/********** WDT Timer ***********/
void wdt_timer_init(void) {
    //Configure Watchdog. a) Pause watchdog while the CPU is halted by the debugger.  b) Keep the watchdog running while the CPU is sleeping.
    NRF_WDT->CONFIG = (WDT_CONFIG_HALT_Pause << WDT_CONFIG_HALT_Pos) | ( WDT_CONFIG_SLEEP_Run << WDT_CONFIG_SLEEP_Pos);  
    NRF_WDT->CRV = 3*32768;             //ca 3 sek. timout
    NRF_WDT->RREN |= WDT_RREN_RR0_Msk;  //Enable reload register 0
    NRF_WDT->TASKS_START = 1;           //Start the Watchdog timer
}

static void reset_wdt_timer(void) {
    NRF_WDT->RR[0] = WDT_RR_RR_Reload;
}

/********** App scheduler ***********/

/* Select max event size. This must be large enough for app timer events as well.
 * uint8_t => button number variable
 * APP_TIMER_SCHED_EVENT_DATA_SIZE => App timer event
 */
#define APP_SCHED_EVENT_SIZE        MAX(sizeof(uint8_t), APP_TIMER_SCHED_EVENT_DATA_SIZE)
#define APP_SCHED_QUEUE_SIZE        (128)


static void scheduled_event_handler(void * p_event_data, uint16_t event_size) {
    uint8_t * key = (uint8_t *) p_event_data;
    uint32_t button_number = *key;
    if (button_number >= 0 && button_number <= 3) {
        button_event_handler(button_number);
    } else {
        app_level_current_value_publish(&m_level_server_0);
        __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Op! %x\n", button_number);
    }
}

static void button_event_handler_irq(uint32_t button_number) {
    static uint8_t bt_num;
    bt_num = button_number;
    app_sched_event_put((void *)&bt_num, sizeof(bt_num), scheduled_event_handler);
}




/********** init and setup ***********/


static void check_commissioning_state() {

    if (commissioning_start_time == 0) return;

    if (timer_diff(timer_now(), commissioning_start_time) > SEC_TO_US(33)) {
        commissioning_start_time = 0;
        factory_reset();
    }
} 

static void app_start(void) {

    load_led_config();
    apply_led_config();
    
    __LOG_RELEASE(LOG_SRC_APP, LOG_LEVEL_INFO, "Starting application \n");

    /* Install rx callback to intercept incoming ADV packets so that they can be passed to the
    EnOcean packet processor */
    //nrf_mesh_rx_cb_set(rx_callback);
}

static void app_mesh_core_event_cb (const nrf_mesh_evt_t * p_evt);

static nrf_mesh_evt_handler_t m_mesh_core_event_handler = { .evt_cb = app_mesh_core_event_cb };

static void app_mesh_core_event_cb(const nrf_mesh_evt_t * p_evt)
{
    /* USER_NOTE: User can insert mesh core event proceesing here */
    switch (p_evt->type)
    {
        /* Start user application specific functions only when flash is stable */
        case NRF_MESH_EVT_FLASH_STABLE:
            __LOG(LOG_SRC_APP, LOG_LEVEL_DBG1, "Mesh evt: FLASH_STABLE \n");
            {
                static bool s_app_started;
                if (!s_app_started)
                {
                    /* Flash operation initiated during initialization has been completed */
                    app_start();
                    s_app_started = true;
                }
            }
            break;
        case NRF_MESH_EVT_TX_COMPLETE:
            __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Mesh evt: NRF_MESH_EVT_TX_COMPLETE %x - %x\n",p_evt->params.tx_complete.token,p_evt->params.tx_complete.timestamp);
            {
                
